Revit 2024 API
IExportContextBase.OnPolyline Method
 This method is called when a Polyline is being output.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
RenderNodeAction OnPolyline(
	PolylineNode node
)
Visual Basic
Function OnPolyline ( _
	node As PolylineNode _
) As RenderNodeAction
Visual C++
RenderNodeAction OnPolyline(
	PolylineNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.PolylineNode
 An output node that represents a Polyline.
Return Value
 Return RenderNodeAction.Proceed if you wish to receive tessellated geometry (polyline segments) for this polyline, or otherwise return RenderNodeAction.Skip.
Note for 2D export: if the export is performed for the view in non-Wireframe display style tesselated geometry will be output regardless of the return value.
Remarks
 Note that this method is invoked only if the custom exporter was set up to include geometric objects in the output stream. See IncludeGeometricObjects for mode details.
Note for 2D export: if the export is performed for the view in non-Wireframe display style this method will be called regardless of whether the object will be eventially output, i.e. even if it's occluded by another element.
See Also
IExportContextBase Interface
Autodesk.Revit.DB Namespace